src/Advanced_IP_Camera/onvif/MediaBinding.SetMetadataConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
  xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc"
  xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
  xmlns:wsa5="http://www.w3.org/2005/08/addressing"
  xmlns:xmime="http://tempuri.org/xmime.xsd"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:tt="http://www.onvif.org/ver10/schema"
  xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
  xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
  xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
  xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
  xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
  xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <trt:SetMetadataConfiguration>
    <trt:Configuration CompressionType="" token="">
     <tt:PTZStatus>
      <tt:Status>false</tt:Status>
      <tt:Position>false</tt:Position>
     </tt:PTZStatus>
     <tt:Events>
      <tt:Filter>
      </tt:Filter>
      <tt:SubscriptionPolicy>
      </tt:SubscriptionPolicy>
     </tt:Events>
     <tt:Analytics>false</tt:Analytics>
     <tt:Multicast>
      <tt:Address>
       <tt:Type>IPv4</tt:Type>
       <tt:IPv4Address></tt:IPv4Address>
       <tt:IPv6Address></tt:IPv6Address>
      </tt:Address>
      <tt:Port>0</tt:Port>
      <tt:TTL>0</tt:TTL>
      <tt:AutoStart>false</tt:AutoStart>
     </tt:Multicast>
     <tt:SessionTimeout>0</tt:SessionTimeout>
     <tt:AnalyticsEngineConfiguration>
      <tt:AnalyticsModule Name="" Type="">
       <tt:Parameters>
        <tt:SimpleItem>
        </tt:SimpleItem>
        <tt:ElementItem>
        </tt:ElementItem>
        <tt:Extension>
        </tt:Extension>
       </tt:Parameters>
      </tt:AnalyticsModule>
      <tt:AnalyticsModule Name="" Type="">
       <tt:Parameters>
        <tt:SimpleItem>
        </tt:SimpleItem>
        <tt:ElementItem>
        </tt:ElementItem>
        <tt:Extension>
        </tt:Extension>
       </tt:Parameters>
      </tt:AnalyticsModule>
      <tt:Extension>
      </tt:Extension>
     </tt:AnalyticsEngineConfiguration>
     <tt:Extension>
     </tt:Extension>
     <tt:Name></tt:Name>
     <tt:UseCount>0</tt:UseCount>
    </trt:Configuration>
    <trt:ForcePersistence>false</trt:ForcePersistence>
   </trt:SetMetadataConfiguration>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
